# IsMonitoringLocalElement Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Element..::..IsMonitoringLocalElement Method
Element Class See Also
---
Indicate whether an element is monitoring other local elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsMonitoringLocalElement()
```

Visual Basic
---
```text
Public Function IsMonitoringLocalElement As Boolean
```

Visual C++
---
```text
public:
bool IsMonitoringLocalElement()
```

# ### Return Value
True if this element is monitoring other elements in same project. Otherwise, false will be returned.
# See Also
Element Class
Autodesk.Revit.DB Namespace